results/factorial-final/security-overhead-final-mtls-broker3/security-overhead-final-factorial-mtls-b3-rf3-isr3-msg102400-tps1000-batch131072-acksall-prod6-compnone-trial3/producer-perf-5.log
producer_index=5
producer_count=6
producer_records=16666
producer_throughput=166
1 records sent, 0.1 records/sec (0.01 MB/sec), 2244.0 ms avg latency, 2244.0 ms max latency.
206 records sent, 40.8 records/sec (3.98 MB/sec), 4152.1 ms avg latency, 8252.0 ms max latency.
538 records sent, 107.3 records/sec (10.48 MB/sec), 2954.9 ms avg latency, 5397.0 ms max latency.
842 records sent, 168.4 records/sec (16.44 MB/sec), 1391.4 ms avg latency, 2234.0 ms max latency.
834 records sent, 166.5 records/sec (16.26 MB/sec), 223.1 ms avg latency, 1010.0 ms max latency.
775 records sent, 154.8 records/sec (15.11 MB/sec), 38.6 ms avg latency, 160.0 ms max latency.
750 records sent, 149.7 records/sec (14.62 MB/sec), 35.3 ms avg latency, 131.0 ms max latency.
799 records sent, 159.5 records/sec (15.57 MB/sec), 32.8 ms avg latency, 145.0 ms max latency.
840 records sent, 168.0 records/sec (16.41 MB/sec), 29.6 ms avg latency, 127.0 ms max latency.
847 records sent, 169.2 records/sec (16.52 MB/sec), 26.0 ms avg latency, 101.0 ms max latency.
810 records sent, 162.0 records/sec (15.82 MB/sec), 22.8 ms avg latency, 92.0 ms max latency.
854 records sent, 170.7 records/sec (16.67 MB/sec), 20.6 ms avg latency, 76.0 ms max latency.
846 records sent, 169.2 records/sec (16.52 MB/sec), 23.8 ms avg latency, 114.0 ms max latency.
817 records sent, 162.8 records/sec (15.90 MB/sec), 22.8 ms avg latency, 108.0 ms max latency.
855 records sent, 170.9 records/sec (16.69 MB/sec), 26.4 ms avg latency, 125.0 ms max latency.
726 records sent, 145.1 records/sec (14.17 MB/sec), 1101.3 ms avg latency, 2091.0 ms max latency.
1006 records sent, 201.2 records/sec (19.64 MB/sec), 178.0 ms avg latency, 970.0 ms max latency.
911 records sent, 182.2 records/sec (17.79 MB/sec), 24.1 ms avg latency, 145.0 ms max latency.
894 records sent, 178.8 records/sec (17.46 MB/sec), 23.0 ms avg latency, 93.0 ms max latency.
859 records sent, 171.5 records/sec (16.74 MB/sec), 19.3 ms avg latency, 93.0 ms max latency.
867 records sent, 173.4 records/sec (16.93 MB/sec), 29.5 ms avg latency, 172.0 ms max latency.
16666 records sent, 147.578146 records/sec (14.41 MB/sec), 306.92 ms avg latency, 8252.00 ms max latency, 24 ms 50th, 1948 ms 95th, 4282 ms 99th, 5071 ms 99.9th.